import time



print("--- WELLCOME TO TAO BIN BEVERAGE ---")
print('---   คาเฟ่อัตโนมัติ 24 ชั่วโมง   ---')
print('''
1.กาแฟ
2.ชา
3.นมและโกโก้
4.โซดา ''')
print('--------------------------')


st = int(input('Select type: '))
print('')
print('--------------------------')


s1 = [ 
    {"name": "มอคค่า",  "price": 45},
    {"name": "กาแฟชาไทย", "price": 25},
    {"name": "ลาเต้", "price": 35}
]



if st == 1:
    print('ประเภทกาแฟ')
    print('')
    for i in range(len(s1)):
        print(f"{i+1}.{s1[i]['name']}      {s1[i]['price']}$")
    print('--------------------------')
    s_1 = int(input('เลือกกาแฟของคุณ: '))
    if s_1 > len(s1)+1 or s_1 < 1: #ดักข้อผิดพลาด
         print('หมายเลขทำรายการไม่ถูกต้อง')
    else:
        print(f"รายการที่ {s_1}: {s1[s_1-1]['name']} ราคา: {s1[s_1-1]['price']}$")
        money = int(input('กรุณาใส่จำนวนเงิน: '))
        if money <= s1[s_1-1]['price']:
            print('จำเงินของคุณไม่เพียงพอ')
        else:
            print('เงินทอนของคุณคือ ',money - (s1[s_1-1]['price']))
            print('กรุณารอสักครู่')
            print('''
░██╗░░░░░░░██╗░█████╗░██╗████████╗░░░░░░░░░
░██║░░██╗░░██║██╔══██╗██║╚══██╔══╝░░░░░░░░░
░╚██╗████╗██╔╝███████║██║░░░██║░░░░░░░░░░░░
░░████╔═████║░██╔══██║██║░░░██║░░░░░░░░░░░░
░░╚██╔╝░╚██╔╝░██║░░██║██║░░░██║░░░██╗██╗██╗
░░░╚═╝░░░╚═╝░░╚═╝░░╚═╝╚═╝░░░╚═╝░░░╚═╝╚═╝╚═╝
''')
            time.sleep(5)


            print('เครื่องดื่มของคุณเสร็จแล้วกรุณารับที่ช่องรับเครื่องดื่ม')

    











elif st == 2:
    print('ประเภทชา')
#     print('''
# 1.ชาไทย        45$
# 2.ชาเขียว       45$
# 3.ชานม         45$     
# 4.ชาดำ         30$
# 5.ชามะลิ        30$''')
    print('--------------------------')
    
elif st == 3:
    print('ประเภทนมและโกโก้')
#     print('''
# 1.โกโก้        45$
# 2.นมสด        45$
# 3.นมเย็น       45$''')
    print('--------------------------')
    
elif st == 4:
    print('ประเภทโซดา')
#     print('''
# 1.แดงมะนาวโซดา     30$
# 2.เขียวโซดา         30$
# 3.บลูฮาวาย          35$''')
    print('--------------------------')
    
else:
    print('หมายเลขทำรายการไม่ถูกต้อง')
